////1.
////*
////***
////*****
////*******
////*********
////***********
////*************
////***********
////*********
////*******
////*****
////***
////*
//#include <stdio.h>
//#include <stdlib.h>
//int main()
//{
//	int line = 0;
//	int i = 0;
//	scanf_s("%d", &line);       //打印的行数
//	for (i = 0; i < line; i++)  //空格              //上半部分 因为上半部分线性增长
//	{
//		int j = 0;
//		for (j = 0; j < line - 1 - i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j < 2 * i + 1; j++)//星号
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	for (i = 0; i < line - 1; i++)            //下半部分  因为下半部分线性递减
//	{
//		int j = 0;
//		for (j = 0; j <= i; j++)  //打印空格
//		{
//			printf(" ");
//		}
//		for (j = 0; j <2 * (line - i - 1) - 1; j++) //打印星号
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	system("pause");
//	return 0;
//}